Revit 2027 API
BuiltInFailures.DimensionFailures.ArcLengthDimensionNoReferencesOnArc Property
 None of the segment references of this Arc Length Dimension intersects the bounded arc of the arc reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ArcLengthDimensionNoReferencesOnArc { get; }
Public Shared ReadOnly Property ArcLengthDimensionNoReferencesOnArc As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ArcLengthDimensionNoReferencesOnArc {
	FailureDefinitionId^ get ();
}
static member ArcLengthDimensionNoReferencesOnArc : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace